package lyxh.sdnu.com.testui;

import java.util.List;

//public class Data {


//一卡通数据
// 请求参数：stuId 如201611010100
/*        {
        "name": "张三",
        "cardId": "55151",
        "date":["周四","周五","周六","周日","周一","周二","周三"],
        "BB": [3.5f,3.4f,2.6f,2.5f,2.5f,2.8f,3.0f],
        "HB": [5.5f,4.5f,8.0f,5.8f,7.2f,4.5f,7.2f],
        "FB": [5.5f,4.5f,8.0f,5.8f,7.2f,4.5f,7.2f],
        }*/

//学生人数
//请求参数 stuId 如 201611010100
//        major 自定义 可为空，表示全院的人数
//        stuCls 自定义 可为空，表示本专业的人数
// 自定义由后台确定需要传入的参数或代号
//        {
//                "college":"信息科学与工程学院",
//                "major":"计算机科学与技术",
//                "stuCls":"计算机科学与技术1601"
//                "stuNum":53
//        }
